<meta charset="utf-8">

<h1>ДЗ 2</h1>
<br>

<?php
    /*Задано дві змінні. Якщо ці змінні – це цілі числа, то вивести
    результат їхніх побітових операцій (і, або, xor, заперечення), а
    також за допомогою операції побітового здвигу помножити перше
    число на 2, а друге число – поділити на 2.

    Якщо задані змінні – дійсні числа, то вивести їхню суму, різницю
    першого і другого числа, добуток, ділення першого числа не друге.

    Якщо змінні – стрічки – вивести стрічку, яка містить перший символ
    першої змінної та останній символ другої.

    В іншому випадку – знищити змінну.*/

    /*$a = 100;
    $b = 6;*/

    /*$a = 10.5;
    $b = 5.8;*/

    $a = "qwe";
    $b = "rty";

    /*$a = 10;
    $b = "qwe";*/

    if ((gettype($a) === integer) and (gettype($b) === integer)){
        echo "<br>$a & $b = "; echo $a & $b;
        echo "<br>$a | $b ="; echo $a | $b;
        echo "<br>$a ^ $b ="; echo $a ^ $b;

        echo "<br>$a << (1) ="; echo $a << 1;
        echo "<br>$b << (1) ="; echo $b >> 1;

    }
    elseif ((gettype($a) === double) and (gettype($b) === double)){
        echo "<br>$a + $b = "; echo $a + $b;
        echo "<br>$a - $b = "; echo $a - $b;
        echo "<br>$a * $b = "; echo $a * $b;
        if (!$b = 0){
            echo "<br>$a / $b = "; echo $a / $b;
        }
        else{
            echo "worning b = 0";
        }
    }
    elseif ((gettype($a) === string) and (gettype($b) === string)) {
        echo "<br> перший символ першої змінної: " . $a[0];
        echo "<br> останній символ другої змінної: " . $b[strlen($b)-1];
    }
    else{
        unset($a);
        unset($b);
    }

?>